# Tessellated Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MeshFromGeometryOperationResult..::..Tessellated Property
MeshFromGeometryOperationResult Class See Also
---
Whether while constructing a mesh, it was necessary to extrude polylines instead of non-linear curves from the profile loops.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool Tessellated { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Tessellated As Boolean
	Get
```

Visual C++
---
```text
public:
property bool Tessellated {
	bool get ();
}
```

# See Also
MeshFromGeometryOperationResult Class
Autodesk.Revit.DB Namespace